## Activity 04: Use Pandas to compute the Mean, Median, and Variance

In this activity, you will consolidate the skills you've acquired in the last exercise and use Pandas to do some very basic mathematical calculations on our `world_population.csv` dataset.   
Pandas have a consistent API, so it should be rather easy to transfer your knowledge of the mean method to median and variance.    
Your already existing knowledge of NumPy will also help.

#### Loading the dataset

In [1]:
# importing the necessary dependencies
import pandas as pd

In [105]:
# loading the Dataset
df = pd.read_csv('./data/world_population.csv',index_col=0)

In [106]:
# looking at the first two rows of the dataset
# df.head(2) or
df[:2]

,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,1966,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
Country Name,,,,,,,,,,,,,,,,,,,,,
Aruba,ABW,Population density (people per sq. km of land ...,EN.POP.DNST,NaN,307.972222,312.366667,314.983333,316.827778,318.666667,320.622222,...,562.322222,563.011111,563.422222,564.427778,566.311111,568.850000,571.783333,574.672222,577.161111,NaN
Andorra,AND,Population density (people per sq. km of land ...,EN.POP.DNST,NaN,30.587234,32.714894,34.914894,37.170213,39.470213,41.800000,...,180.591489,182.161702,181.859574,179.614894,175.161702,168.757447,161.493617,154.863830,149.942553,NaN

---

In [107]:
#show indexces
df.index

Index(['Aruba', 'Andorra', 'Afghanistan', 'Angola', 'Albania', 'Arab World',
       'United Arab Emirates', 'Argentina', 'Armenia', 'American Samoa',
       ...
       'Vietnam', 'Vanuatu', 'West Bank and Gaza', 'World', 'Samoa',
       'Yemen, Rep.', 'South Africa', 'Congo, Dem. Rep.', 'Zambia',
       'Zimbabwe'],
      dtype='object', name='Country Name', length=264)

In [79]:
df.dtypes

1960    float64
1961    float64
1962    float64
1963    float64
1964    float64
1965    float64
1966    float64
1967    float64
1968    float64
1969    float64
1970    float64
1971    float64
1972    float64
1973    float64
1974    float64
1975    float64
1976    float64
1977    float64
1978    float64
1979    float64
1980    float64
1981    float64
1982    float64
1983    float64
1984    float64
1985    float64
1986    float64
1987    float64
1988    float64
1989    float64
1990    float64
1991    float64
1992    float64
1993    float64
1994    float64
1995    float64
1996    float64
1997    float64
1998    float64
1999    float64
2000    float64
2001    float64
2002    float64
2003    float64
2004    float64
2005    float64
2006    float64
2007    float64
2008    float64
2009    float64
2010    float64
2011    float64
2012    float64
2013    float64
2014    float64
2015    float64
2016    float64
dtype: object

In [108]:
df=df.select_dtypes(exclude=object)

In [109]:
df.head()

,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
Country Name,,,,,,,,,,,,,,,,,,,,,
Aruba,NaN,307.972222,312.366667,314.983333,316.827778,318.666667,320.622222,322.494444,324.361111,326.244444,...,562.322222,563.011111,563.422222,564.427778,566.311111,568.850000,571.783333,574.672222,577.161111,NaN
Andorra,NaN,30.587234,32.714894,34.914894,37.170213,39.470213,41.800000,44.159574,46.570213,49.065957,...,180.591489,182.161702,181.859574,179.614894,175.161702,168.757447,161.493617,154.863830,149.942553,NaN
Afghanistan,NaN,14.038148,14.312061,14.599692,14.901579,15.218206,15.545203,15.881812,16.235931,16.618433,...,39.637202,40.634655,41.674005,42.830327,44.127634,45.533197,46.997059,48.444546,49.821649,NaN
Angola,NaN,4.305195,4.384299,4.464433,4.544558,4.624228,4.703271,4.782892,4.865721,4.955244,...,15.387749,15.915819,16.459536,17.020898,17.600302,18.196544,18.808215,19.433323,20.070565,NaN
Albania,NaN,60.576642,62.456898,64.329234,66.209307,68.058066,69.874927,71.737153,73.805547,75.974270,...,108.394781,107.566204,106.843759,106.314635,106.013869,105.848431,105.717226,105.607810,105.444051,NaN

In [110]:
# show two rows
df1=df[:2]
df1

,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
Country Name,,,,,,,,,,,,,,,,,,,,,
Aruba,NaN,307.972222,312.366667,314.983333,316.827778,318.666667,320.622222,322.494444,324.361111,326.244444,...,562.322222,563.011111,563.422222,564.427778,566.311111,568.850000,571.783333,574.672222,577.161111,NaN
Andorra,NaN,30.587234,32.714894,34.914894,37.170213,39.470213,41.800000,44.159574,46.570213,49.065957,...,180.591489,182.161702,181.859574,179.614894,175.161702,168.757447,161.493617,154.863830,149.942553,NaN

#### Mean

In [111]:
# calculate the mean of the third row
#dataset[2] here this does not work bacause here index has name
 # series  output
#     df.iloc[2]
# dataframe output
df.iloc[[2]].mean(axis=1)

Country Name
Afghanistan    25.373379
dtype: float64

In [112]:
# calculate the mean of the third row
df.iloc[[2]].mean(axis=1)

Country Name
Afghanistan    25.373379
dtype: float64

In [73]:
# calculate the mean of the last row
#dataset.tail(1).mean(axis=1)
df.iloc[[-1]].mean(axis=1)

# series vs dataframe [] [[]]

Country Name
Zimbabwe    24.520532
dtype: float64

In [80]:
# calculate the mean of the country Germany
#L in loc refers to Label
df.loc[['Germany']].mean(axis=1)

Country Name
Germany    227.773688
dtype: float64

**Note:**   
`.iloc()` and `.loc()` are two important methods when indexing with Pandas. They allow making precise selections of data based on either the integer value index (`iloc`) or the index column (`loc`), which in our case is the country name column.

---

#### Median

In [75]:
# calculate the median of the last row

df.iloc[[-1]].median(axis=1)

Country Name
Zimbabwe    25.505431
dtype: float64

In [113]:
# calculate the median of the last 3 rows
df.iloc[[-3,-2,-1]].median(axis=1)
# or
# df.iloc[-3:].median(axis=1)

Country Name
Congo, Dem. Rep.    14.419050
Zambia              10.352668
Zimbabwe            25.505431
dtype: float64

**Note:**   
Slicing can be done in the same way as with NumPy.   
`dataset[1:3]` will return the second and third row of our dataset.

In [114]:
# calculate the median of the first 10 countries
df.iloc[:10].median(axis=1,numeric_only=True)

Country Name
Aruba                   348.022222
Andorra                 107.300000
Afghanistan              19.998926
Angola                    8.458253
Albania                 106.001058
Arab World               15.307283
United Arab Emirates     19.305072
Argentina                11.618238
Armenia                 105.898033
American Samoa          220.245000
dtype: float64

**Note:**   
When handling larger datasets, the order in which methods get executed definitely matters.   
Think about what `.head(10)` does for a moment, it simply takes your dataset and returns the first 10 rows of it, cutting down your input to the `.mean()` method drastically.   
This will definitely have an impact when using more memory intensive calculations, so keep an eye on the order.

---

#### Variance

In [101]:
# calculate the variance of the last 5 columns
df.iloc[:,-5:].var(axis=0)

2012    3.086912e+06
2013    3.118260e+06
2014    3.181243e+06
2015    3.245246e+06
2016             NaN
dtype: float64

---

As mentioned in the introduction of Pandas, it's interoperable with several of NumPy's features.   
Here's an example of how to use NumPy's `mean` method with a Pandas DataFrame.

In [118]:
# NumPy Pandas interoperability
import numpy as np

In [120]:
print('mean of 2015 using Pandas:',df['2015'].mean())
print('mean of 2015 using Numpy:',np.mean(df['2015']))

mean of 2015 using Pandas: 368.70660104001837
mean of 2015 using Numpy: 368.70660104001837